Core/src/Catalogs/Комиссии/Комиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Комиссии</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтраслевойДокумент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияРасформирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписаниеПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияФункционируетПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодписиКомиссии</name>
    <attributes>
      <name>ЭтоПодписьПредседателяКомиссии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьЧленаКомиссии</name>
      <type>
        <types>CatalogRef.Подписи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
    <items>
      <name>ТранзитныйСклад</name>
      <description>ტრანზიტული საწყობი</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРозницеРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценкиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзитныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/Комиссии/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Отборы - Структура - Структура со значениями отборов
//
// Допустимые значения отборов:
//	Отборы.Период - Дата
//	Отборы.Организация - Справочник.Организации
//	Отборы.СтруктурнаяЕдиница - Справочник.СтруктурныеЕдиницы
//	Отборы.ОтраслевойДокумент - (см. ДокументыСКомиссиями)
//
Функция КомиссияПоУмолчанию(Отборы) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"Выбрать Комиссии.Ссылка КАК Комиссия
	|Из Справочник.Комиссии КАК Комиссии
	|Где НЕ Комиссии.КомиссияРасформирована
	| И &Период МЕЖДУ Комиссии.ДатаПодписаниеПриказа И Комиссии.КомиссияФункционируетПо
	| И Комиссии.Организация = &Организация
	| И Комиссии.ОтраслевойДокумент = &ОтраслевойДокумент
	| И (Комиссии.СтруктурнаяЕдиница = &СтруктурнаяЕдиница 
	|		ИЛИ Комиссии.СтруктурнаяЕдиница = Значение(Справочник.СтруктурныеЕдиницы.ПустаяССылка))
	|Упорядочить по Комиссии.СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("Период", Отборы.Период);
	Запрос.УстановитьПараметр("Организация", Отборы.Организация);
	Запрос.УстановитьПараметр("ОтраслевойДокумент", Отборы.ОтраслевойДокумент);
	
	Если Отборы.Свойство("СтруктурнаяЕдиница") Тогда
		
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Отборы.СтруктурнаяЕдиница);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Комиссии.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "Истина");
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Комиссия, Неопределено);
	
КонецФункции

Функция ОписаниеДокументовСКомиссиями(МетаданныеДокументов)
	
	ДокументыСКомиссиями = Новый Соответствие;
	
	Для каждого МетаданныеДокумента Из МетаданныеДокументов Цикл
		
		СправочникИОМ = СтандартныеПодсистемыПовтИсп.ИдентификаторОбъектаМетаданныхПоПолномуИмени(МетаданныеДокумента.ПолноеИмя());
		ДокументыСКомиссиями.Вставить(СправочникИОМ.Имя, СправочникИОМ.Синоним);
		
	КонецЦикла;
	
	Возврат ДокументыСКомиссиями;
	
КонецФункции

Функция ДокументыСКомиссиями() Экспорт
	
	МетаданныеДокументов = Новый Массив;
	МетаданныеДокументов.Добавить(Метаданные.Документы.ИнвентаризацияЗапасов);
	МетаданныеДокументов.Добавить(Метаданные.Документы.ПриходныйОрдер);
	
	Возврат ОписаниеДокументовСКомиссиями(МетаданныеДокументов);
	
КонецФункции

Функция КомиссияИспользуетсяВДокументах(Комиссия) Экспорт
	
	ДокументыСКомиссиями		= ДокументыСКомиссиями();
	
	Схема						= Новый СхемаЗапроса;
	ПакетЗапросовСхемыЗапросов	= Схема.ПакетЗапросов[0];
	Операторы					= ПакетЗапросовСхемыЗапросов.Операторы;
	
	ПервыйОператор = Истина;
	Для каждого ОписаниеДокумента Из ДокументыСКомиссиями Цикл
		
		ОператорТаблицы = ?(ПервыйОператор, Операторы[0], Операторы.Добавить());
		ОператорТаблицы.Источники.Добавить("Документ." + ОписаниеДокумента.Ключ, ОписаниеДокумента.Ключ);
		ОператорТаблицы.ТипОбъединения = ТипОбъединенияСхемыЗапроса.ОбъединитьВсе;
		ОператорТаблицы.ВыбираемыеПоля.Добавить(ОписаниеДокумента.Ключ + ".Ссылка");
		ОператорТаблицы.Отбор.Добавить(ОписаниеДокумента.Ключ + ".Комиссия = &Комиссия И " + ОписаниеДокумента.Ключ + ".Комиссия <> ЗНАЧЕНИЕ(Справочник.Комиссии.ПустаяСсылка)");
		
		ПервыйОператор = Ложь;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Комиссия", Комиссия);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПодписиКомиссииМассивом(Комиссия) Экспорт
	
	РазмерКомиссии = 0;
	Если ЗначениеЗаполнено(Комиссия) Тогда
		
		РазмерКомиссии = Комиссия.ПодписиКомиссии.Количество();
		
	КонецЕсли;
	
	СтруктураКомиссии = Новый Структура;
	СтруктураКомиссии.Вставить("ПодписьПредседателя", Неопределено);
	СтруктураКомиссии.Вставить("РазмерКомиссии", РазмерКомиссии);
	СтруктураКомиссии.Вставить("ПодписиКомиссии", Новый Массив);
	
	Если РазмерКомиссии > 0 Тогда
		
		Для каждого СтрокаОписанияПодписи Из Комиссия.ПодписиКомиссии Цикл
			
			Если СтрокаОписанияПодписи.ЭтоПодписьПредседателяКомиссии Тогда
				
				СтруктураКомиссии.ПодписьПредседателя = СтрокаОписанияПодписи.ПодписьЧленаКомиссии;
				
			КонецЕсли;
			
			СтруктураКомиссии.ПодписиКомиссии.Добавить(СтрокаОписанияПодписи.ПодписьЧленаКомиссии);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураКомиссии;
	
КонецФункции

Процедура РасформироватьКомиссииПриУвольнении(ДополнительныеСвойства, Отказ) Экспорт
	
	ТаблицаКомиссийКРасформированию = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКомиссийКРасформированию;
	Для каждого СтрокаТаблицы Из ТаблицаКомиссийКРасформированию Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Комиссия) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ПодписьОбъект = СтрокаТаблицы.Комиссия.ПолучитьОбъект();
		Попытка
			
			ПодписьОбъект.Заблокировать();
			ПодписьОбъект.КомиссияРасформирована = Истина;
			ПодписьОбъект.Записать();
			
		Исключение
			
			Отка = Истина;
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


#Область ИнтерфейсПечати

Функция ШаблоныТекстовПечатнойФормы(ЭтоИнвентаризация)
	
	ТекстыЗаполненияПФ = Новый Структура;
	Если ЭтоИнвентаризация Тогда
		
		ТекстыЗаполненияПФ.Вставить("ОписаниеПриказа",					НСтр("ka='о создании инвентаризационной комиссии по предприятию:';ru='о создании инвентаризационной комиссии по предприятию:';en='the establishment of the inventory commission for the enterprise:'"));
		ТекстыЗаполненияПФ.Вставить("НазначениеКомиссии",				НСтр("ka='с целью проведения инвентаризационных работ назначается постоянно действующая комиссия в составе:';ru='с целью проведения инвентаризационных работ назначается постоянно действующая комиссия в составе:';en='to conduct inventory work be appointed a permanent commission composed of:'"));
		ТекстыЗаполненияПФ.Вставить("ОбязанностиКомиссииЗаголовок",		НСтр("ka='Постоянно действующая инвентаризационная комиссия осуществляет свою работу в соответствии с учетной политикой организации и утверждается текущим приказом. В обязанности комиссии входит:';ru='Постоянно действующая инвентаризационная комиссия осуществляет свою работу в соответствии с учетной политикой организации и утверждается текущим приказом. В обязанности комиссии входит:';en='Permanent inventory commission carries out its work in accordance with the accounting policy of the organization and approved by the current order. The duties of the Commission include:'"));
		ТекстыЗаполненияПФ.Вставить("Пункт1",							НСтр("ka='1. Обеспечивает проведение инвентаризаций всего имущества и всех обязательств организации;';ru='1. Обеспечивает проведение инвентаризаций всего имущества и всех обязательств организации;';en='1. Provides conduct an inventory of all assets and all liabilities of the organization;'"));
		ТекстыЗаполненияПФ.Вставить("Пункт2",							НСтр("ka='2. В период проведения плановых инвентаризаций курирует и обобщает деятельность рабочих предприятия.';ru='2. В период проведения плановых инвентаризаций курирует и обобщает деятельность рабочих предприятия.';en='2. At the time of the planned inventory supervises and summarizes the activities of the factory workers.'"));
		ТекстыЗаполненияПФ.Вставить("СрокДействияКомиссииЗаголовок",	НСтр("ka='Персональный состав постоянно действующей инвентаризационной комиссии назначается сроком до:';ru='Персональный состав постоянно действующей инвентаризационной комиссии назначается сроком до:';en='Personal structure of the permanent inventory commission appointed for a term up to:'"));
		
	Иначе
		
		ТекстыЗаполненияПФ.Вставить("ОписаниеПриказа",					НСтр("ka='о создании комиссии по предприятию:';ru='о создании комиссии по предприятию:';en='to establish a commission for the enterprise:'"));
		ТекстыЗаполненияПФ.Вставить("НазначениеКомиссии",				НСтр("ka='с целью оприходования товаров без счета поставщика назначается постоянно действующая комиссия в составе:';ru='с целью оприходования товаров без счета поставщика назначается постоянно действующая комиссия в составе:';en='for the purpose of posting the goods without the vendor invoice is assigned a permanent commission composed of:'"));
		ТекстыЗаполненияПФ.Вставить("ОбязанностиКомиссииЗаголовок",		НСтр("ka='Постоянно действующая комиссия осуществляет свою работу в соответствии с учетной политикой организации и утверждается текущим приказом. В обязанности комиссии входит:';ru='Постоянно действующая комиссия осуществляет свою работу в соответствии с учетной политикой организации и утверждается текущим приказом. В обязанности комиссии входит:';en='Permanent commission carries out its work in accordance with the accounting policy of the organization and approved by the current order. The duties of the Commission include:'"));
		ТекстыЗаполненияПФ.Вставить("Пункт1",							НСтр("ka='1. Обеспечивает приемку и оприходования фактически полученных товарно-материальных ценностей, поступивших без счета поставщика;';ru='1. Обеспечивает приемку и оприходования фактически полученных товарно-материальных ценностей, поступивших без счета поставщика;';en='1. Provides the receipt and posting actually received inventory items received without an account of the supplier;'"));
		ТекстыЗаполненияПФ.Вставить("Пункт2",							НСтр("ka='2. Оформляет документы, которые подтверждают фактическое наличие товаров (ТОРГ-4) и обобщает деятельность рабочих предприятия.';ru='2. Оформляет документы, которые подтверждают фактическое наличие товаров (ТОРГ-4) и обобщает деятельность рабочих предприятия.';en='2. Prepares documents that confirm the actual availability of goods (tendering-4) and summarizes the activities of the factory workers.'"));
		ТекстыЗаполненияПФ.Вставить("СрокДействияКомиссииЗаголовок",	НСтр("ka='Персональный состав постоянно действующей комиссии назначается сроком до:';ru='Персональный состав постоянно действующей комиссии назначается сроком до:';en='Personal structure of the permanent commission shall be appointed for up to:'"));
		
	КонецЕсли;
	
	Возврат ТекстыЗаполненияПФ;
	
КонецФункции

Функция ПечатьПриказа(МассивОбъектов, ОбъектыПечати, Макет) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПФ_XML_ПриказОСозданииКомиссии";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"Выбрать
	|	СпрКомиссий.Ссылка
	|	,СпрКомиссий.Код КАК Номер
	|	,СпрКомиссий.Организация
	|	,СпрКомиссий.Организация.Префикс КАК Префикс
	|	,СпрКомиссий.Организация.ПодписьРуководителя.Должность КАК ПредставлениеДолжностиРуководителя
	|	,СпрКомиссий.Организация.ПодписьРуководителя.РасшифровкаПодписи КАК ПредставлениеРуководителя
	|	,СпрКомиссий.СтруктурнаяЕдиница
	|	,СпрКомиссий.ДатаПодписаниеПриказа
	|	,Выбор Когда СпрКомиссий.ОтраслевойДокумент = &ИмяДокументаИнвентаризация Тогда Истина
	|		Иначе Ложь Конец КАК ЭтоИнвентаризация
	|	,СпрКомиссий.КомиссияФункционируетПо
	|	,СпрКомиссий.ПодписиКомиссии.(
	|		ЭтоПодписьПредседателяКомиссии КАК ЭтоПредседатель
	|		,ПодписьЧленаКомиссии.РасшифровкаПодписи КАК ПодписьЧленаКомиссии
	|		,ПодписьЧленаКомиссии.Должность КАК Должность) КАК СоставКомиссии
	|Из Справочник.Комиссии КАК СпрКомиссий Где СпрКомиссий.Ссылка В(&МассивОбъектов)
	|Упорядочить по ЭтоПредседатель Убыв";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ИмяДокументаИнвентаризация", Метаданные.Документы.ИнвентаризацияЗапасов.Имя);
	ДанныеДокументов = Запрос.Выполнить().Выбрать();
	
	ЗначенияДокумента = Новый Структура;
	
	ПервыйДокумент = Истина;
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ПервыйДокумент = Ложь;
			ЗначенияДокумента.Очистить();
			
		КонецЕсли;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТекстыЗаполненияПФ = ШаблоныТекстовПечатнойФормы(ДанныеДокументов.ЭтоИнвентаризация);
		
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
		
		ПредставлениеПриказа = НСтр("ka='Приказ №%1 от %2';ru='Приказ №%1 от %2';en='Order №% 1% 2 from'");
		НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(ДанныеДокументов.Номер, ДанныеДокументов.Префикс);
		ПредставлениеПриказа = СтрШаблон(ПредставлениеПриказа, НомерДокумента, Формат(ДанныеДокументов.ДатаПодписаниеПриказа, "ДЛФ=DD"));
		ЗначенияДокумента.Вставить("ПредставлениеПриказа", ПредставлениеПриказа);
		
		ЗначенияДокумента.Вставить("ОписаниеПриказа", ТекстыЗаполненияПФ.ОписаниеПриказа);
		ЗначенияДокумента.Вставить("НазначениеКомиссии", ТекстыЗаполненияПФ.НазначениеКомиссии);
		
		СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ДанныеДокументов.Организация, ДанныеДокументов.ДатаПодписаниеПриказа);
		ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование");
		ЗначенияДокумента.Вставить("Организация", ПредставлениеОрганизации);
		
		СтруктурнаяЕдиница = ?(ЗначениеЗаполнено(ДанныеДокументов.СтруктурнаяЕдиница), ДанныеДокументов.СтруктурнаяЕдиница, НСтр("ka='По организации в целом';ru='По организации в целом';en='According to the organization as a whole'"));
		ЗначенияДокумента.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		
		ОбластьМакетаШапка.Параметры.Заполнить(ЗначенияДокумента);
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		ОбластьМакетаПредседатель = Макет.ПолучитьОбласть("Председатель");
		ОбластьМакетаПервый = Макет.ПолучитьОбласть("КомиссияПервый");
		ОбластьМакетаПоследующий = Макет.ПолучитьОбласть("КомиссияПоследующий");
		
		СоставКомиссии = ДанныеДокументов.СоставКомиссии.Выбрать();
		Пока СоставКомиссии.Следующий() Цикл
			
			ЗначенияДокумента.Очистить();
			
			ЗначенияДокумента.Вставить("Должность", СоставКомиссии.Должность);
			ЗначенияДокумента.Вставить("Представление", СоставКомиссии.ПодписьЧленаКомиссии);
			
			Если СоставКомиссии.ЭтоПредседатель И НЕ ОбластьМакетаПредседатель = Неопределено Тогда
				
				ОбластьМакетаПредседатель.Параметры.Заполнить(ЗначенияДокумента);
				ТабличныйДокумент.Вывести(ОбластьМакетаПредседатель);
				ОбластьМакетаПредседатель = Неопределено;
				
			ИначеЕсли НЕ ОбластьМакетаПервый = Неопределено Тогда
				
				ОбластьМакетаПервый.Параметры.Заполнить(ЗначенияДокумента);
				ТабличныйДокумент.Вывести(ОбластьМакетаПервый);
				ОбластьМакетаПервый = Неопределено;
				
			Иначе
				
				ОбластьМакетаПоследующий.Параметры.Заполнить(ЗначенияДокумента);
				ТабличныйДокумент.Вывести(ОбластьМакетаПоследующий);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ЗначенияДокумента.Вставить("ОбязанностиКомиссииЗаголовок", ТекстыЗаполненияПФ.ОбязанностиКомиссииЗаголовок);
		ЗначенияДокумента.Вставить("Пункт1", ТекстыЗаполненияПФ.Пункт1);
		ЗначенияДокумента.Вставить("Пункт2", ТекстыЗаполненияПФ.Пункт2);
		ЗначенияДокумента.Вставить("СрокДействияКомиссииЗаголовок", ТекстыЗаполненияПФ.СрокДействияКомиссииЗаголовок);
		
		Если ЗначениеЗаполнено(ДанныеДокументов.КомиссияФункционируетПо) Тогда
			
			СрокДействияКомиссии = ПечатьДокументовУНФ.ПредставлениеДатыВДокументах(ДанныеДокументов.КомиссияФункционируетПо);
			
		Иначе
			
			СрокДействияКомиссии = НСтр("ka='Комиссия фукционирует бессрочно';ru='Комиссия фукционирует бессрочно';en='Commission fuktsioniruet indefinitely'");
			
		КонецЕсли;
		ЗначенияДокумента.Вставить("СрокДействияКомиссии", СрокДействияКомиссии);
		ЗначенияДокумента.Вставить("ПредставлениеРуководителя", ДанныеДокументов.ПредставлениеРуководителя);
		ЗначенияДокумента.Вставить("ДолжностьРуководителя", ДанныеДокументов.ПредставлениеДолжностиРуководителя);
		
		ОбластьМакетаПодвал.Параметры.Заполнить(ЗначенияДокумента);
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПриказОСозданииКомиссии");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПолныйПутьКМакету				= "Справочник.Комиссии.ПФ_XML_ПриказОСозданииКомиссии";
		Макет							= УправлениеПечатью.МакетПечатнойФормы(ПолныйПутьКМакету);
		ПечатнаяФорма.ТабличныйДокумент = ПечатьПриказа(МассивОбъектов, ОбъектыПечати, Макет);
		ПечатнаяФорма.СинонимМакета		= НСтр("ka='Приказ о создании комиссии';ru='Приказ о создании комиссии';en='Order to establish a commission'");
		ПечатнаяФорма.ПолныйПутьКМакету = ПолныйПутьКМакету;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПриказОСозданииКомиссии";
	КомандаПечати.Представление = НСтр("ka='Приказ о создании комиссии';ru='Приказ о создании комиссии';en='Order to establish a commission'");
	КомандаПечати.СписокФорм = "ФормаЭлемента,ФормаСписка";
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
